# LoadServices Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationConfiguration..::..LoadServices Method
FabricationConfiguration Class See Also
---
Loads the specified fabrication services into the project.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public IList<int> LoadServices(
	IList<int> serviceIds
)
```

Visual Basic
---
```text
Public Function LoadServices ( _
	serviceIds As IList(Of Integer) _
) As IList(Of Integer)
```

Visual C++
---
```text
public:
IList<int>^ LoadServices(
	IList<int>^ serviceIds
)
```

# ### Parameters
serviceIds
    Type: System.Collections.Generic..::..IList<(Of <(<'Int32>)>)> The identifiers of the fabrication services to load.
# ### Return Value
The identifiers of the fabrication services which failed to load.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The current fabrication configuration is not connected and updated to source configuration. Reload and try again. -or- this operation failed. |

# See Also
FabricationConfiguration Class
Autodesk.Revit.DB Namespace